<?php
    class sql{

        //===========================================================
        //SQL接続
        //===========================================================
        //引き数　： DB DB_HOST DB_USER DB_PASS
        //戻り値　：　dbh
        //-----------------------------------------------------------
        public function sql_get($db,$db_host,$db_user,$db_pass){
            $dbn="";
            $dbh="";
            $dsn = 'mysql:dbname='.$db.'; 
                    host='.$db_host.';
                    charset=utf8';
            //PDOでデータベースに接続
            $dbh = new PDO($dsn,$db_user,$db_pass);
            
            return $dbh;
        }            
        //===========================================================
        //全データ取得
        //===========================================================
        //引き数　： 
        //戻り値　：　
        //-----------------------------------------------------------
        public function get_date_all($dbh){
            //-------------------------------------------------------
            //変数初期化
            //-------------------------------------------------------
            $data_all=array();
            //-------------------------------------------------------
            //SQL処理
            //-------------------------------------------------------
            $dbh -> setAttribute(PDO::ATTR_ERRMODE,PDO::ERRMODE_WARNING);                           //エラーレベル設定
            $sql="SELECT * FROM stocks";                                                            //SQL文作成 
            $stmt = $dbh -> prepare($sql);      
            $stmt -> execute();                                                                     //クエリの実行
            // var_dump($stmt);                                                                     //配列表示(確認のため)
            $data_all = $stmt->fetch(PDO::FETCH_ASSOC);                                             //一行取得

            return $data_all;
        }
    }
?>